import {SightBlockProps} from "../components/App";

export type CountriesContent = {
    ukraine: {
        content: SightBlockProps[]
    },
    uk: {
        content: SightBlockProps[]
    },
    usa: {
        content: SightBlockProps[]
    },
    poland: {
        content: SightBlockProps[]
    },
    germany: {
        content: SightBlockProps[]
    }
}

export const content: CountriesContent = {
    ukraine: {
        content: [
            {
                title: "Києво-Печерська лавра",
                image: "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fb/%D0%9B%D0%B0%D0%B2%D1%80%D0%B0.jpg/1280px-%D0%9B%D0%B0%D0%B2%D1%80%D0%B0.jpg",
                description: "Відіграючи значну роль в об’єднанні східних земель як духовний, соціальний, культурний та просвітницький центр, Києво-Печерська лавра мала заслужену славу не лише на території Київської Русі, а й у Польщі, Вірменії, Візантії, Болгарії та інших країнах… Сьогодні Національний Києво-Печерський історико-культурний заповідник – найбільший музейний комплекс України, де зосереджено 144 споруди, 122 з яких – пам’ятки історії і культури. Серед них – 2 унікальних підземних комплекси, храми, пам’ятки архітектури XI–XIX ст., численні виставкові приміщення.",
                price: 150
            },
            {
                title: "Золоті ворота (Київ)",
                image: "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8a/Golden_Gate_Kiev_2018_G1.jpg/1280px-Golden_Gate_Kiev_2018_G1.jpg",
                description: "У центрі Києва, неподалік від Софійського собору, розташована відома пам’ятка оборонної та сакральної архітектури Київської Русі – Золоті ворота. Як і Софія Київська, Золоті ворота належать до найдавніших споруд Східної Європи. Пам’ятка згадується у відомій літописній статті 1037 року, що розповідає про будівничу діяльність князя Ярослава Мудрого: “Заложив Ярослав город – великий Київ, а в города сього ворота є Золоті. Заложив він також церкву святої Софії, Премудрості Божої, митрополію, а потім церкву на Золотих воротах, кам’яну, Благовіщення святої Богородиці.. Після цього (він звів) монастир святого Георгія (Побідоносця) і (монастир) святої Орини…” Цим записом літописець підсумував будівничі заслуги Ярослава за весь період його правління, воздав   їм хвалу. В науці  забудовану цими спорудами територію давнього Києва прийнято називати “містом Ярослава”.",
                price: 75
            },
            {
                title: "Антонієві печери (Чернігів)",
                image: "https://cheline.com.ua/wp-content/uploads/2019/01/Antoniyevi-pecheri1-e1548769807916.jpg",
                description: "Антонієві печери в Чернігові — пам’ятка підземної культової архітектури XI—XIX століть. Засновані вони в 1069 році як печерний християнський монастир князем Святославом Ярославичем і відомим церковним діячем давньоруської доби — прп. Антонієм Печерським, який народився на Чернігівщині у місті Любечі. Згідно з літописом, монастир спочатку мав назву Богородичний (монастир Божої Матері). Літописець стверджує, що Антоній прибув до Чернігова, рятуючись від гніву князя київського Ізяслава. Він полюбив Болдині гори, викопав печеру і з того часу на Болдиних горах існує монастир. Його заснування тісно пов’язано з гострим суперництвом між двома найбільшими культурними та політичними центрами держави — Києвом та Черніговом.",
                price: 99
            }
        ]
    },
    uk: {
        content: [
            {
                title: "Біг-Бен",
                image: "https://upload.wikimedia.org/wikipedia/commons/thumb/9/93/Clock_Tower_-_Palace_of_Westminster%2C_London_-_May_2007.jpg/800px-Clock_Tower_-_Palace_of_Westminster%2C_London_-_May_2007.jpg",
                description: "Біг Бен це великий годинник в якому розташований один з найбільших дзвонів тисячоліття. Також – гордість Великої Британії та чудового міста Лондон. Під час цієї невеличкої мандрівки великою дзвіницею ми дізнаємось багато цікавого. Прекрасна мам’ятка архітектури створена талановитим архітектором Чарльзом Бері, за наказом Британського парламенту та королеви Вікторії І.",
                price: 250
            },
            {
                title: "Вестмінстерське абатство",
                image: "https://tsikaviy-svit.com/upload/images/%D0%B0%D0%B1%D0%B0%D1%82%D1%81%D1%82%D0%B2%D0%BE.jpg",
                description: "Собор Святого Петра у Вестмінстері, який майже завжди називають Вестмінстерське абатство - мабуть, найвідоміша церковна знаменитість. Величезні розміри вражають навіть сучасника. А якщо врахувати, що споруда будувалася з використанням примітивних технологій, то інженерам того часу можна аплодувати стоячи.",
                price: 95
            },
            {
                title: "Віндзорський замок",
                image: "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8f/Windsor_Castle_at_Sunset_-_Nov_2006.jpg/450px-Windsor_Castle_at_Sunset_-_Nov_2006.jpg",
                description: "У Віндзорі живе біля 29 тисяч чол., більша частина з яких займається обслуговуванням туристів. Подорож до Віндзора припаде до смаку шанувальникам провінційної Англії. Це чудове місце для прогулянок після метушливої англійської столиці. Віндзор здавен був «родовим гніздом» англійської династії, свята й інші публічні заходи, що проводяться тут, завжди мають особливий статус. У травні у Віндзорі відбувається популярне Королівське кінне шоу, а у червні - Аскотські кінні перегони, відомих ще з початку XVIII століття. У цьому ж місяці у замку проводиться урочиста Церемонія Підв'язки.",
                price: 550
            }
        ]
    },
    usa: {
        content: [
            {
                title: "Великий каньйон",
                image: "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5a/Grand_Canyon.jpg/1280px-Grand_Canyon.jpg",
                description: "На сьогоднішній день Великий Каньйон або Гранд-Каньйон в США по праву визнаний одним з найбільш дивовижних і незвичайних геологічних об’єктів, що існують на планеті. Крім того, саме цей природний об’єкт є одним з найглибших у світі. У ньому одночасно присутні чотири геологічні епохи Землі. Великий каньйон – одна з найбільших на планеті ущелин. За десять мільйонів років його промила в вапняних породах швидка річка Колорадо. Гранд-Каньйон вражає фантастичними розмірами й марсіанськими пейзажами.",
                price: 120
            },
            {
                title: "Ніагарський водоспад",
                image: "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Niagara3573.jpg/1280px-Niagara3573.jpg",
                description: "Ніагарський водоспад ( Niagara Falls )- ряд масивних водоспадів, розташованих на річці Ніагара – здавна славиться міццю і чарівністю. Назва « Ніагара » пішла від ірокезького слова « Onguiaahra », що в перекладі означає «грім води». Пропонуємо вашій увазі деякі цікаві відомості про Ніагарський водоспад. Ніагарський водоспад утворився внаслідок відступу льодовиків в кінці Вісконсинського заледеніння, коли води з недавно сформованих Великих озер разом прорізали доріжку через Ніагарський Розлом в дорозі до Атлантичного океану. Ніагарські водоспади не найвищі у світі, але вони відрізняються великою шириною. Їх ширина становить 1060 футів ( 323 м), а висота – 176 футів ( 53 метри). Слід зазначити, що Ніагарський водоспад- один з найпотужніших водоспадів у Північній Америці.",
                price: 10
            },
            {
                title: "Центральний парк (Нью-Йорк)",
                image: "https://upload.wikimedia.org/wikipedia/commons/thumb/0/05/Southwest_corner_of_Central_Park%2C_looking_east%2C_NYC.jpg/1280px-Southwest_corner_of_Central_Park%2C_looking_east%2C_NYC.jpg",
                description: "Центральный парк в Нью-Йорке является, без преувеличения, самым знаменитым парком в мире. История парка берет свое начало 21 июля 1853 года, когда высшим законодательным органом штата Нью-Йорк был принят закон о выделении 750 акров земли в центре острова Манхэттен для основания первого ландшафтного парка Америки.",
                price: 0
            }
        ]
    },
    poland: {
        content: [
            {
                title: "Морське Окo",
                image: "https://andreolli.com.ua/wp-content/uploads/2017/04/IMG_4935.jpg",
                description: "Вважається одним з найгарніших гірських озер Польщі, а для когось, можливо, і в світі. Розташоване в долині Риб’ячого Потоку (Doliny Rybiego Potoku), чудова локація, адже це недалеко від міста Закопане. Вважалось, що озеро поєднувалось під землею з Середземним морем, тому й така назва. У кришталево чистій воді відбиваються величні Татри в поєднанні з гірським повітрям та ароматами хвої, такий собі кусочок Раю на землі. Однозначно варте для відвідин.",
                price: 50
            },
            {
                title: "Хохоловска Долина",
                image: "https://andreolli.com.ua/wp-content/uploads/2017/04/DSC_0117.jpg",
                description: "Вважається найбільшою та найдовшою долиною в польських Татрах. Надзвичайної краси місце, яке вкрите соснами та луками, навесні крокусами, а восени першим інієм, чудово споглядати в будь-яку пору року. Але візьміть до уваги, що вхід на територію за додаткову оплату.",
                price: 65
            },
            {
                title: "Копальня солі у Велічці",
                image: "https://andreolli.com.ua/wp-content/uploads/2017/04/Wieliczka_32848-1024x683.jpg",
                description: "Невеличке містечко поблизу Кракова. Копальня ж вважається колишнім джерелом багатства країни, адже видобуток солі тут тягнеться ще з 13-го століття, а також вона є однією з найстаріших копалень в світі. Тут надзвичайно цікаво, адже залишилось збереженим оригінальне обладнання, техніка. Також під землею проводяться конференції, банкети та виставки виробів з солі. Можна випити чашечку кави в ресторані чи придбати сувеніри для близьких в магазинах або ж відправити листа додому прямісінько з підземної пошти. А на останок відвідайте підземний санаторій, де лікуються хвороби верхніх дихальних шляхів та астма.",
                price: 199
            }
        ]
    },
    germany: {
        content: [
            {
                title: "Бранденбурзькі ворота",
                image: "https://sights.com.ua/wp-content/webp-express/webp-images/uploads/2021/04/brandenburg-gate.jpg.webp",
                description: "Символ столиці Німеччини, з 1989 року символ возз’єднання країни. Збудував архітектор Карл Готтард Ланґганс. Проект воріт він робив за мотивами Акрополя. Спорудження в стилі класицизму чудово поєднується з іншими будівлями на Паризькій площі. Окрасою воріт є квадрига висотою 6 метрів з колісницею, якою управляє Вікторія – богиня перемоги. Барельєфи внутрішніх стін зображують подвиги Геракла.",
                price: 15
            },
            {
                title: "Рейхстаг",
                image: "https://sights.com.ua/wp-content/webp-express/webp-images/uploads/2021/04/rejhstag.jpg.webp",
                description: "Будівля Національних зборів. У довжину ця монументальна споруда становить 137 метрів, а в ширину – 103 метра. Побудовано в стилі італійського відродження в 1894 році. Чотири вежі будівлі символізують німецькі королівства. Їх висота – 46 метрів. На вершину скляного купола можна піднятися, звідти відкривається вид на урядовий квартал і на саме місто.",
                price: 99
            },
            {
                title: "Марієнплац (Мюнхен)",
                image: "https://sights.com.ua/wp-content/webp-express/webp-images/uploads/2021/04/marienplac.jpg.webp",
                description: "Центральна площа міста, заснована в 1158 році. Назва що перекладається як «Площа Марії», отримана в честь колони Святої Марії, побудованої в 1638 році. У середні віки на площі влаштовували лицарські турніри. Також починаючи з доби середньовіччя на площі розміщується ринок Віктуалієнмаркт. Визначною пам’яткою площі є найвищий собор Мюнхена Фрауенкірхе. Під площею прокладена розв’язка метро.",
                price: 50
            }
        ]
    }
}